yuukiokamiya/QCS_Silicon_Partners/applications/sensordummy/ek_ra6m4_sensordummy_da14531_baremetal_custom_profile/src/qe_gen/ble/profile_cmn/r_ble_servc_if.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2019 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
#include <stdlib.h>
#include <string.h>
#include "r_ble_servc_if.h"
#include "qe_gen/ble/discovery/r_ble_disc.h"

typedef struct {
	st_ble_dev_addr_t bd_addr;
	uint16_t conn_hdl;
	uint8_t conn_idx;

	/* Used for Long Read */
	uint16_t read_attr_hdl;
	uint8_t *p_read_buf;
	uint16_t read_buf_pos;

	/* Used for Long Write */
	uint16_t write_attr_hdl;
} st_ble_conn_info_t;

static st_ble_conn_info_t gs_conn_info[BLE_SERVC_MAX_NUM_OF_SAVED];
static const st_ble_servc_info_t *gs_clients[BLE_SERVC_MAX_NUM_OF_CLIENTS];
static uint8_t gs_num_of_clients;

static uint8_t find_conn_idx_from_bd_addr(const st_ble_dev_addr_t *p_addr) {
	for (uint8_t i = 0; i < BLE_SERVC_MAX_NUM_OF_SAVED; i++) {
		if ((gs_conn_info[i].bd_addr.type == p_addr->type)
				&& (0
						== memcmp(gs_conn_info[i].bd_addr.addr, p_addr->addr,
								BLE_BD_ADDR_LEN))) {
			return i;
		}
	}

	return 0xFF;
}

static uint8_t find_conn_idx_from_conn_hdl(uint16_t conn_hdl) {
	for (uint8_t i = 0; i < BLE_SERVC_MAX_NUM_OF_SAVED; i++) {
		if (gs_conn_info[i].conn_hdl == conn_hdl) {
			return i;
		}
	}

	return 0xFF;
}

static void set_conn_idx(uint16_t conn_hdl, const st_ble_dev_addr_t *p_addr) {
	for (uint8_t i = 0; i < BLE_SERVC_MAX_NUM_OF_SAVED; i++) {
		/* If we already have the peer attr hdls, use it. */
		if ((gs_conn_info[i].bd_addr.type == p_addr->type)
				&& (0
						== memcmp(gs_conn_info[i].bd_addr.addr, p_addr->addr,
								BLE_BD_ADDR_LEN))) {
			gs_conn_info[i].conn_hdl = conn_hdl;
			return;
		}
	}

	for (uint8_t i = 0; i < BLE_SERVC_MAX_NUM_OF_SAVED; i++) {
		if (BLE_GAP_INVALID_CONN_HDL == gs_conn_info[i].conn_hdl) {
			memcpy(&gs_conn_info[i].bd_addr, p_addr,
					sizeof(gs_conn_info[i].bd_addr));
			gs_conn_info[i].conn_hdl = conn_hdl;
			break;
		}
	}
}

static void clear_conn_idx(uint16_t conn_hdl) {
	uint8_t conn_idx;

	conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);

	if (0xFF != conn_idx) {
		gs_conn_info[conn_idx].conn_hdl = BLE_GAP_INVALID_CONN_HDL;
	}
}

static void find_attr(uint8_t conn_idx, uint16_t attr_hdl,
		const st_ble_servc_info_t **pp_client,
		const st_ble_servc_char_info_t **pp_char) {
	for (uint8_t s = 0; s < gs_num_of_clients; s++) {
		for (uint8_t c = 0; c < gs_clients[s]->num_of_chars; c++) {
			if ((gs_clients[s]->pp_chars[c]->p_attr_hdls[conn_idx].start_hdl
					<= attr_hdl)
					&& (gs_clients[s]->pp_chars[c]->p_attr_hdls[conn_idx].end_hdl
							>= attr_hdl)) {
				*pp_client = gs_clients[s];
				*pp_char = gs_clients[s]->pp_chars[c];
			}
		}
	}
}

static void read_evt_handler(uint16_t conn_hdl, uint16_t attr_hdl,
		st_ble_gatt_value_t *p_value, ble_status_t result) {
	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);

	const st_ble_servc_info_t *p_client = NULL;
	const st_ble_servc_char_info_t *p_attr = NULL;
	find_attr(conn_idx, attr_hdl, &p_client, &p_attr);

	if (NULL != p_attr) {
		/* Characteristic */
		if (attr_hdl == p_attr->p_attr_hdls[conn_idx].start_hdl + 1) {
			if (BLE_SUCCESS == result) {
				ble_status_t ret;
				void *p_app_value;

				p_app_value = malloc(p_attr->app_size);
				memset(p_app_value, 0x00, p_attr->app_size);

				ret = p_attr->decode(p_app_value, p_value);

				if (NULL != p_attr->read_rsp_cb) {
					p_attr->read_rsp_cb(p_attr, conn_hdl, ret, p_app_value);
				} else {
					st_ble_servc_evt_data_t evt_data = { .conn_hdl = conn_hdl,
							.param_len = p_attr->app_size, .p_param =
									p_app_value, };
					p_client->cb(
							BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx,
									p_attr->inst_idx, BLE_SERVC_READ_RSP),
							BLE_SUCCESS, &evt_data);
				}

				free(p_app_value);
			} else {
				if (NULL != p_attr->read_rsp_cb) {
					p_attr->read_rsp_cb(p_attr, conn_hdl, result, NULL);
				} else {
					st_ble_servc_evt_data_t evt_data = { .conn_hdl = conn_hdl,
							.param_len = 0, .p_param = NULL, };
					p_client->cb(
							BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx,
									p_attr->inst_idx, BLE_SERVC_READ_RSP),
							result, &evt_data);
				}
			}
		}
		/* Descriptor */
		else {
			for (uint8_t d = 0; d < p_attr->num_of_descs; d++) {
				if (attr_hdl == p_attr->pp_descs[d]->p_attr_hdls[conn_idx]) {
					if (BLE_SUCCESS == result) {
						ble_status_t ret;
						uint8_t *p_app_value;

						p_app_value = malloc(p_attr->pp_descs[d]->app_size);
						memset(p_app_value, 0x00,
								p_attr->pp_descs[d]->app_size);

						ret = p_attr->pp_descs[d]->decode(p_app_value, p_value);

						if (NULL != p_attr->pp_descs[d]->read_rsp_cb) {
							p_attr->pp_descs[d]->read_rsp_cb(
									&p_attr->pp_descs[d], conn_hdl, ret,
									p_app_value);
						} else {
							st_ble_servc_evt_data_t evt_data = { .conn_hdl =
									conn_hdl, .param_len =
									p_attr->pp_descs[d]->app_size, .p_param =
									p_app_value, };
							p_client->cb(
									BLE_SERVC_MULTI_ATTR_EVENT(
											p_attr->pp_descs[d]->desc_idx,
											p_attr->inst_idx,
											BLE_SERVC_READ_RSP), BLE_SUCCESS,
									&evt_data);
						}

						free(p_app_value);
					} else {
						if (NULL != p_attr->pp_descs[d]->read_rsp_cb) {
							p_attr->pp_descs[d]->read_rsp_cb(
									&p_attr->pp_descs[d], conn_hdl, result,
									NULL);
						} else {
							st_ble_servc_evt_data_t evt_data = { .conn_hdl =
									conn_hdl, .param_len = 0, .p_param = NULL, };
							p_client->cb(
									BLE_SERVC_MULTI_ATTR_EVENT(
											p_attr->pp_descs[d]->desc_idx,
											p_attr->inst_idx,
											BLE_SERVC_READ_RSP), result,
									&evt_data);
						}
					}
					break;
				}
			}
		}
	}
}

static void write_evt_handler(uint16_t conn_hdl, uint16_t attr_hdl,
		ble_status_t result) {
	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);

	const st_ble_servc_info_t *p_client = NULL;
	const st_ble_servc_char_info_t *p_attr = NULL;
	find_attr(conn_idx, attr_hdl, &p_client, &p_attr);

	if (NULL != p_attr) {
		/* Characteristics */
		if (attr_hdl == p_attr->p_attr_hdls[conn_idx].start_hdl + 1) {
			if (NULL != p_attr->write_rsp_cb) {
				p_attr->write_rsp_cb(p_attr, conn_hdl, result);
			} else {
				st_ble_servc_evt_data_t evt_data = { .conn_hdl = conn_hdl,
						.param_len = 0, .p_param = NULL, };
				p_client->cb(
						BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx,
								p_attr->inst_idx, BLE_SERVC_WRITE_RSP), result,
						&evt_data);
			}
		}
		/* Descriptors */
		else {
			for (uint8_t d = 0; d < p_attr->num_of_descs; d++) {
				if (attr_hdl == p_attr->pp_descs[d]->p_attr_hdls[conn_idx]) {
					if (NULL != p_attr->pp_descs[d]->write_rsp_cb) {
						p_attr->pp_descs[d]->write_rsp_cb(&p_attr->pp_descs[d],
								conn_hdl, result);
					} else {
						st_ble_servc_evt_data_t evt_data = { .conn_hdl =
								conn_hdl, .param_len = 0, .p_param = NULL, };
						p_client->cb(
								BLE_SERVC_MULTI_ATTR_EVENT(
										p_attr->pp_descs[d]->desc_idx,
										p_attr->inst_idx, BLE_SERVC_WRITE_RSP),
								result, &evt_data);
					}
					break;
				}
			}
		}
	}
}

