yuukiokamiya/QCS_Silicon_Partners/applications/sensordummy/ek_ra6m4_sensordummy_da14531_baremetal_custom_profile/src/qe_gen/ble/profile_cmn/r_ble_servc_if.c
			case 0x12: /* Write Request) */
			{
				if (NULL != p_attr->write_rsp_cb) {
					p_attr->write_rsp_cb(p_attr, p_data->conn_hdl,
							p_err_rsp_evt_param->rsp_code);
				} else {
					st_ble_servc_evt_data_t evt_data = { .conn_hdl =
							p_data->conn_hdl, .param_len = 2, .p_param =
							&p_err_rsp_evt_param->attr_hdl, };
					p_client->cb(
							BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx,
									p_attr->inst_idx, BLE_SERVC_WRITE_RSP),
							p_err_rsp_evt_param->rsp_code, &evt_data);
				}
			}
				break;
			}
		}
	}
		break;

	case BLE_GATTC_EVENT_INVALID: {
	}
		break;

	case BLE_GATTC_EVENT_EX_MTU_RSP:
	case BLE_GATTC_EVENT_CHAR_READ_BY_UUID_RSP:
	case BLE_GATTC_EVENT_MULTI_CHAR_READ_RSP:
	case BLE_GATTC_EVENT_RELIABLE_WRITES_TX_COMP:
	case BLE_GATTC_EVENT_RELIABLE_WRITES_COMP:
	default: {
		break;
	}
	}
}

ble_status_t R_BLE_SERVC_Init(void) {
	for (uint8_t i = 0; i < BLE_SERVC_MAX_NUM_OF_SAVED; i++) {
		gs_conn_info[i].conn_hdl = BLE_GAP_INVALID_CONN_HDL;
	}
	gs_num_of_clients = 0;
	return BLE_SUCCESS;
}

ble_status_t R_BLE_SERVC_RegisterClient(const st_ble_servc_info_t *p_info) {
	ble_status_t ret;
	if (BLE_SERVC_MAX_NUM_OF_CLIENTS > gs_num_of_clients) {
		gs_clients[gs_num_of_clients++] = p_info;
		ret = BLE_SUCCESS;
	} else {
		ret = BLE_ERR_CONTEXT_FULL;
	}

	return ret;
}

ble_status_t R_BLE_SERVC_ReadChar(const st_ble_servc_char_info_t *p_attr,
		uint16_t conn_hdl) {
	ble_status_t ret;

	if (NULL == p_attr) {
		return BLE_ERR_INVALID_ARG;
	}

	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
	if (0xFF == conn_idx) {
		return BLE_ERR_INVALID_HDL;
	}

	uint16_t mtu = BLE_GATT_DEFAULT_MTU;
	R_BLE_GATT_GetMtu(conn_hdl, &mtu);

	if (p_attr->db_size <= (mtu - 3)) {
		ret = R_BLE_GATTC_ReadChar(conn_hdl,
				(uint16_t)(p_attr->p_attr_hdls[conn_idx].start_hdl + 1));
	} else {
		ret = R_BLE_GATTC_ReadLongChar(conn_hdl,
				(uint16_t)(p_attr->p_attr_hdls[conn_idx].start_hdl + 1), 0);
	}

	return ret;
}

ble_status_t R_BLE_SERVC_WriteChar(const st_ble_servc_char_info_t *p_attr,
		uint16_t conn_hdl, const void *p_app_value) {
	ble_status_t ret;

	if ((NULL == p_attr) || (NULL == p_app_value)) {
		return BLE_ERR_INVALID_ARG;
	}

	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
	if (0xFF == conn_idx) {
		return BLE_ERR_INVALID_HDL;
	}

	uint8_t *p_byte_value;
	p_byte_value = malloc(p_attr->db_size);
	memset(p_byte_value, 0x00, p_attr->db_size);

	st_ble_gatt_value_t gatt_value = { .p_value = p_byte_value, .value_len =
			p_attr->db_size, };

	ret = p_attr->encode(p_app_value, &gatt_value);

	st_ble_gatt_hdl_value_pair_t write_data = { .attr_hdl = (uint16_t)(
			p_attr->p_attr_hdls[conn_idx].start_hdl + 1), .value.p_value =
			gatt_value.p_value, .value.value_len = gatt_value.value_len, };

	if (BLE_SUCCESS != ret) {
		return BLE_ERR_INVALID_DATA;
	}

	uint16_t mtu = BLE_GATT_DEFAULT_MTU;
	R_BLE_GATT_GetMtu(conn_hdl, &mtu);

	if (write_data.value.value_len <= (mtu - 3)) {
		ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
	} else {
		ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
	}

	free(p_byte_value);

	return ret;
}

ble_status_t R_BLE_SERVC_WriteCmdChar(const st_ble_servc_char_info_t *p_attr,
		uint16_t conn_hdl, const void *p_app_value) {
	ble_status_t ret;

	if ((NULL == p_attr) || (NULL == p_app_value)) {
		return BLE_ERR_INVALID_ARG;
	}

	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
	if (0xFF == conn_idx) {
		return BLE_ERR_INVALID_HDL;
	}

	uint8_t *p_byte_value;
	p_byte_value = malloc(p_attr->db_size);
	memset(p_byte_value, 0x00, p_attr->db_size);

	st_ble_gatt_value_t gatt_value = { .p_value = p_byte_value, .value_len =
			p_attr->db_size, };

	ret = p_attr->encode(p_app_value, &gatt_value);

	st_ble_gatt_hdl_value_pair_t write_data = { .attr_hdl = (uint16_t)(
			p_attr->p_attr_hdls[conn_idx].start_hdl + 1), .value.p_value =
			gatt_value.p_value, .value.value_len = gatt_value.value_len, };

	if (BLE_SUCCESS != ret) {
		return BLE_ERR_INVALID_DATA;
	}

	ret = R_BLE_GATTC_WriteCharWithoutRsp(conn_hdl, &write_data);

	free(p_byte_value);

	return ret;
}

ble_status_t R_BLE_SERVC_ReadDesc(const st_ble_servc_desc_info_t *p_attr,
		uint16_t conn_hdl) {
	if (NULL == p_attr) {
		return BLE_ERR_INVALID_ARG;
	}

	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
	if (0xFF == conn_idx) {
		return BLE_ERR_INVALID_HDL;
	}

	uint16_t mtu = BLE_GATT_DEFAULT_MTU;
	R_BLE_GATT_GetMtu(conn_hdl, &mtu);

	if (p_attr->db_size <= (mtu - 1)) {
		return R_BLE_GATTC_ReadChar(conn_hdl, p_attr->p_attr_hdls[conn_idx]);
	} else {
		return R_BLE_GATTC_ReadLongChar(conn_hdl, p_attr->p_attr_hdls[conn_idx],
				0);
	}
}

ble_status_t R_BLE_SERVC_ReadDesc_with_Type(
		const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl,
		int32_t type) {
	if (NULL == p_attr) {
		return BLE_ERR_INVALID_ARG;
	}

	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
	if (0xFF == conn_idx) {
		return BLE_ERR_INVALID_HDL;
	}

	uint16_t mtu = BLE_GATT_DEFAULT_MTU;
	R_BLE_GATT_GetMtu(conn_hdl, &mtu);

	if (0 == type) {
		return R_BLE_GATTC_ReadChar(conn_hdl, p_attr->p_attr_hdls[conn_idx]);
	} else {
		return R_BLE_GATTC_ReadLongChar(conn_hdl, p_attr->p_attr_hdls[conn_idx],
				0);
	}
}

ble_status_t R_BLE_SERVC_WriteDesc(const st_ble_servc_desc_info_t *p_attr,
		uint16_t conn_hdl, const void *p_app_value) {
	ble_status_t ret;

	if ((NULL == p_attr) || (NULL == p_app_value)) {
		return BLE_ERR_INVALID_ARG;
	}

	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
	if (0xFF == conn_idx) {
		return BLE_ERR_INVALID_HDL;
	}

	uint8_t *p_byte_value;
	p_byte_value = malloc(p_attr->db_size);
	memset(p_byte_value, 0x00, p_attr->db_size);

	st_ble_gatt_value_t gatt_value = { .p_value = p_byte_value, .value_len =
			p_attr->db_size, };

	ret = p_attr->encode(p_app_value, &gatt_value);

	st_ble_gatt_hdl_value_pair_t write_data = { .attr_hdl =
			p_attr->p_attr_hdls[conn_idx], .value.p_value = gatt_value.p_value,
			.value.value_len = gatt_value.value_len, };

	if (BLE_SUCCESS != ret) {
		return BLE_ERR_INVALID_DATA;
	}

	uint16_t mtu = BLE_GATT_DEFAULT_MTU;
	R_BLE_GATT_GetMtu(conn_hdl, &mtu);

	if (p_attr->db_size <= (mtu - 3)) {
		ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
	} else {
		ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
	}

	free(p_byte_value);

	return ret;
}

ble_status_t R_BLE_SERVC_WriteDesc2(const st_ble_servc_desc_info_t *p_attr,
		uint16_t conn_hdl, const void *p_app_value) {
	ble_status_t ret;

	if ((NULL == p_attr) || (NULL == p_app_value)) {
		return BLE_ERR_INVALID_ARG;
	}

	uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
	if (0xFF == conn_idx) {
		return BLE_ERR_INVALID_HDL;
	}

